package com.example.shayri;

import android.annotation.SuppressLint;
import android.content.Intent;
import android.os.Bundle;
import android.util.Log;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.ListView;
import android.widget.TextView;

import androidx.activity.EdgeToEdge;
import androidx.appcompat.app.AppCompatActivity;
import androidx.core.graphics.Insets;
import androidx.core.view.ViewCompat;
import androidx.core.view.WindowInsetsCompat;

public class MainActivity2 extends AppCompatActivity {

    TextView next;

    int colr2[]={R.drawable.aaa,R.drawable.aab,R.drawable.aac,R.drawable.aad,R.drawable.aae,
            R.drawable.aaa,R.drawable.aab,R.drawable.aac,R.drawable.aad,R.drawable.aae,R.drawable.aaa};

    String[] morning = {"सुबह की धूप सुनहरी, नयी सुबह, नया सवेरा, मुस्कान से हो शुरुआत, खुशियों से भरा बसेरा।",
            "ताजगी भरी सुबह में, सपनों की नई उड़ान, दिल से करो हर काम, दिन हो आपका महान।",
            "सूरज की पहली किरण, आपको दे नई उमंग, हर दिन हो प्यारा आपका, खुशियों की हो तरंग।",
            "फूलों की महक सुबह, दिल को दे प्यार की राह, हर लम्हा हो खुशी का, हर दिन हो शानदार।",
            "सुबह का उजाला छाए, दिल को सुकून दिलाए, हर दिन हो खास आपका, जीवन में खुशियाँ लाए।",
            "पंछियों की चहचहाहट, नई सुबह का पैगाम, हर दिन हो रोशनी से भरा, खुशियों का बने निशान।",
            "सुबह की ठंडी हवा, दिल में नई उम्मीद जगाए, मुस्कान से शुरू हो दिन, हर कदम पर खुशियाँ पाए।",
            "चाय की मीठी चुस्की, और सूरज की पहली किरण, खुशियों से भरा दिन हो, आपकी हो हर पल शरण।",
            "नया सवेरा, नई किरण, दिल में भर दे नया जीवन, हर दिन आपका खास बने, और मिले सुकून का चमन।",
            "सुबह की प्यारी रौनक, चाय की मीठी चुस्की, हर दिन हो आपके लिए, खुशियों की नई दस्तक।"};
    String[] afternoon = {"दोपहर की धूप में छुपा, अपने सपनों का रंग बिखरा।",
            "सूरज की किरणों के साथ, दिल में खुशियों का गीत सजा।",
            "आसमान में बादल धीरे-धीरे, समय की लम्बाई छू रहे हैं।",
            "दोपहर की चाय के साथ, हो जाए सब कुछ महका-महका।",
            "गर्मी की छूट के साथ, आता है आराम का वक्त।",
            "आँखों में भरकर सपनों को, बिना खोये तनहाई का मजा।",
            "दोपहर की धूप में ढलके, नयी उम्मीदों का संगम।",
            "दिन बीतता है सोहनी सोहनी, आता है मीठी मीठी यादें।",
            "चाहे जैसा भी हो दिन, खुशियों से हो भरपूर।",
            "दोपहर की रौनक में, हर दिल को मिले सुकून।"};
    String[] evening = {"शाम की धुप में लिपटे, सपनों की मिठास है।",
            "सूरज ढलते-ढलते, दिल को सुकून मिले।",
            "गहरी रात का सजा, ख्वाबों की दुनिया सजी है।",
            "छोटी-छोटी बातों में, खुशियों की भरमार है।",
            "शाम की रौनक से, जीवन को रंगीनी मिले।",
            "चाँदनी की किरनों में, दिल को सुकून दिखलाए।",
            "गुलाबी शाम के साथ, खुशीयाँ हर कोने में।",
            "हर शाम नयी कहानी, दिल को सुलगाती है।",
            "शाम की राहत से भरी, धड़कनों की आहट है।",
            "अब जागती है रात की, गहरी खामोशी के साथ।"};
    String[] night = {"रात की राहत से भरी, धड़कनों की आहट है।",
            "अब जागती है रात की, गहरी खामोशी के साथ।",
            "चाँदनी की रात में, दिल को सुकून मिले।",
            "गहरी रात का चांद, सब कुछ स्पर्श करे गुलाबी।",
            "तारों की बारात सजी, रात ये सबको भाए।",
            "गहरी रात की चांदनी, हर दिल को बहलाए।",
            "नींद की गहरी रात में, ख्वाबों की दुनिया सजी है।",
            "रात की रौनक से, जीवन को रंगीनी मिले।",
            "गुलाबी रात के साथ, खुशियाँ हर कोने में।",
            "हर रात नयी कहानी, दिल को सुलगाती है।"};
    String[] birthday = {"जन्मदिन की बधाई हो, खुशियाँ आपके घर आए।",
            "ख्वाबों की रानी बनकर, जीवन में आप खिले।",
            "दिल से दुआ है हमारी, आपका जन्मदिन मुबारक हो।",
            "आपके हों सपने सच, यही बार-बार दुआ है हमारी।",
            "जन्मदिन की बधाई आपको, खुशियाँ बरसाएं आप पर।",
            "दिल से निकली ये दुआ, हैप्पी बर्थडे तो यू।",
            "आपके जन्मदिन पर, खुशियों का हो बहुत समर्पण।",
            "सपनों की नौकरी बनकर, जन्मदिन पर आप चले।",
            "खुशियों के फूल बनकर, जन्मदिन पर आप खिले।",
            "जन्मदिन की बधाई देते हैं, आपको हम सारी दुआ।"};
    String[] anniversary = {"शादी की सालगिरह की बधाई हो, खुशियाँ आपके घर आए।",
            "प्यार भरी ये शादी की सालगिरह, हमेशा बनी रहे आपकी बहार।",
            "दिल से दुआ है हमारी, आपकी शादी की सालगिरह मुबारक हो।",
            "आपके हों प्यार और सम्मान सच, यही बार-बार दुआ है हमारी।",
            "शादी की सालगिरह की बधाई आपको, खुशियाँ बरसाएं आप पर।",
            "दिल से निकली ये दुआ, सालगिरह की आपको बहुत शुभकामनाएं।",
            "आपके विवाह जयंती पर, प्यार और भरपूर खुशियाँ हों।",
            "खुशियों के रास्ते बनकर, विवाह जयंती पर आप चले।",
            "प्यार के फूल बनकर, विवाह जयंती पर आप खिले।",
            "शादी की सालगिरह की बधाई देते हैं, आपको हम सारी शुभकामनाएं।"};
    String[] happy = {"खुशियों की बरसात हो, दिल को सुकून दे।",
            "हर पल खुशी का मौसम हो, आपका जीवन रंगीन बने।",
            "खुशियों से भरी हर सुबह हो, मन में शांति बने।",
            "मुस्कान की धूप हर दिन, दिल को बहार मिले।",
            "हर दिन हो खुशियों से भरा, आपका हर सपना पूरा हो।",
            "खुशियों की सिर्फ बारिश हो, हर दिन आपका खास हो।",
            "दिल से निकली ये दुआ, आपका हर पल खुशहाल हो।",
            "हर रात की रोशनी हो, दिल को सुकून मिले।",
            "खुशियों से भरा हर पल, जीवन का हर मोड़ मीठा हो।",
            "खुशियों के गीत गाएं, दिल को हर दर्द से राहत मिले।"};
    String[] sad = {"दर्द भरी रातें, बेचैनी की बातें।",
            "अजनबी राहों में खोया, वो एहसास बहुत याद आता है।",
            "आँखों में अब भी वो आंसू, जो दिल को चूभते हैं।",
            "दिल की गहराइयों में छूपा, एक पुराना दर्द बसा है।",
            "किसी के बिना अब सुकून नहीं, तन्हाई ने आबाद किया है।",
            "वो ख्वाब बिना बताए छूट गए, जो हकीकत बन जाते थे।",
            "खुशियाँ जब भी आए, दर्द का एहसास बहुत होता है।",
            "दिल की हर धड़कन एक ख्वाब बनकर, टूट जाती है।",
            "बदलती दुनिया में अकेलापन, बहुत कुछ सिखाता है।",
            "कुछ रिश्ते बिना कहे ही टूट गए, उन यादों में खोया हूँ।"};
    String[] angry = {"गुस्सा भरी आँखों से देखो मुझे, अब तक बर्दाश्त किया है मैंने।",
            "दिल में छुपी ये आग, देख लो तुम क्या खो दोगे।",
            "कभी तो सोचा होगा तुमने, क्यों हर बार तुम्हारे लिए ही रुकता हूँ।",
            "मेरे दिल का हर ताला तोड़ दिया तुमने, अब देखो तुम कहाँ खड़े हो।",
            "खुद को सजा दूं तुम्हें या फिर खुद को तुम्हारी वजह से सजा दूं।",
            "तुम्हारी बेवफाई से नहीं, अपनी बेवफाई से गुस्सा हूँ मैं।",
            "जब समझोगे तुम मुझे, तब होगी ये बात समझ में।",
            "अब न चाहिए कोई मुझे दर्द, किताबों में मैंने पढ़ लिया है सब।",
            "तुमने तो मेरी बेइज्जती कर दी, अब देखते हैं कैसे भुला देते हैं।",
            "बस अब रोशनी बंद करो, तुम्हारे लिए तो अब रात ही काफी है।"};
    String[] love = {"तुम्हारी बातें, तुम्हारी यादें, तुम्हारी खुशबू, तुम्हारा साथ।",
            "दिल की धड़कन में बसा है तुम्हारा नाम, तुम्हारे बिना ये जिंदगी है बेकार।",
            "तुम्हारी बिना जीना मुश्किल होता है, तुम्हारी यादों से दिल को बहुत तसल्ली होती है।",
            "तुम्हारी मुस्कान में छुपा है मेरा सबकुछ, तुम्हारे बिना जीना बेमानी है।",
            "तेरी यादों का एक जादू है, जो दिल को बहुत बहालाता है।",
            "तेरे प्यार की रोशनी में जीना है, बस यही एक तमन्ना है।",
            "तुम्हारी बिना दिल नहीं लगता, तुम्हारे साथ हर लम्हा बहुत खास होता है।",
            "तेरी बाहों में मिलना है मुझे, तेरी यादों में खोना है मुझे।",
            "तेरी मोहब्बत के नशे में खोना है, तेरे बिना जीना मुश्किल होता है।",
            "तुम्हारे प्यार में खो जाना है, तुम्हारे साथ हर दिन बिताना है।"};
    String[] motivation = {"हार नहीं मानूंगा, बढ़ता जाऊंगा।",
            "मंजिल की तलाश में, नए सफर पर निकल पड़ूंगा।",
            "जिंदगी की हर मुश्किल को हासिल करेंगे हम।",
            "अपने सपनों को पाने के लिए लहराएंगे हम।",
            "उड़ान भरेंगे बुलंदी की ओर, हर रुकावट को दूर करेंगे हम।",
            "हर कठिनाई से जूझना सीखा है, हर चुनौती को स्वीकार करना सीखा है।",
            "सपनों को अपनी पंखों से ऊँचा उड़ाना है, मंजिल की ओर बढ़ना है।",
            "हो सकता है कि रास्ते में मुश्किलें आएं, लेकिन हौंसला नहीं हारना है।",
            "जीवन के हर पल को खुशी से भरना है, हर मुश्किल को हासिल करना है।",
            "क्या कमी रह गई है जो हमने नहीं पाया, हर रोज नए सपनों को साकार करना है।"};

    ListView shayri;
    String[] blank = {""};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main2);

        next = findViewById(R.id.txt);
        shayri = findViewById(R.id.shayri);

        String t = getIntent().getStringExtra("ds");
        next.setText(t);

        Log.d("/*-/", "onCreate: " + t);
        ArrayAdapter ad;

        if (t.equals("morning")) {
            blank = morning;
        } else if (t.equals("afternoon")) {
            blank = afternoon;
        }else if (t.equals("evening")) {
            blank = evening;
        }else if (t.equals("night")) {
            blank = night;
        }else if (t.equals("birthday")) {
            blank = birthday;
        }else if (t.equals("anniversary")) {
            blank = anniversary;
        }else if (t.equals("happy")) {
            blank = happy;
        }else if (t.equals("sad")) {
            blank = sad;
        }else if (t.equals("angry")) {
            blank = angry;
        }else if (t.equals("love")) {
            blank = love;
        }else if (t.equals("motivation")) {
            blank = motivation;
        }

//        ad = new ArrayAdapter(MainActivity2.this, R.layout.newvalue, blank);
//        shayri.setAdapter(ad);

        Myclass2 ds = new Myclass2(blank,MainActivity2.this,colr2);
        shayri.setAdapter(ds);

        shayri.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {

//                Intent p =new Intent(MainActivity2.this,MainActivity3.class);
//                p.putExtra("dp",blank[position]);
//                startActivity(p);

                startActivity(new Intent(MainActivity2.this,MainActivity3.class)
                        .putExtra("shyri",blank[position])
                        .putExtra("array",blank)
                        .putExtra("ds",position));


            }
        });

    }
}